# Welcome to Jupyter!

# Welcome to Week 2

In [1]:
import pandas as pd

In [2]:
#Create a list where each element is a dictionary

df = pd.DataFrame([{'name':'chris', 'item purchased':'sponge', 'cost':22.5}, 
                   {'name': 'kevyn', 'item purchased':'kitty litter', 'cost':2.50},
                   {'name':'Filip', 'item purchased':'spoon', 'cost':5.0}],
                    index = ['store 1', 'store 2', 'store 3']);
df

         cost item purchased   name
store 1  22.5         sponge  chris
store 2   2.5   kitty litter  kevyn
store 3   5.0          spoon  Filip

# Adding a new column in the data frame

In [3]:
df['date'] = ['december 1', 'january 1', 'mid may']
df

         cost item purchased   name        date
store 1  22.5         sponge  chris  december 1
store 2   2.5   kitty litter  kevyn   january 1
store 3   5.0          spoon  Filip     mid may

## Adding a new column with default values

In [4]:
df['delivered'] = True
df

         cost item purchased   name        date  delivered
store 1  22.5         sponge  chris  december 1       True
store 2   2.5   kitty litter  kevyn   january 1       True
store 3   5.0          spoon  Filip     mid may       True

## Handling missing data while adding a new column

In [5]:
df['feedback'] = ['positive', None, 'negative']
df

#We have to input none values ourselves

         cost item purchased   name        date  delivered  feedback
store 1  22.5         sponge  chris  december 1       True  positive
store 2   2.5   kitty litter  kevyn   january 1       True      None
store 3   5.0          spoon  Filip     mid may       True  negative

# Resetting indexes on the data frame

In [6]:
df.reset_index()
df

         cost item purchased   name        date  delivered  feedback
store 1  22.5         sponge  chris  december 1       True  positive
store 2   2.5   kitty litter  kevyn   january 1       True      None
store 3   5.0          spoon  Filip     mid may       True  negative

In [7]:
# Let's reset the index and then use the indexing operations to assign values

adf = df.reset_index();


# Notice the use of Series to assign indexed based values of new entries
# Notice the use of () on series creation
adf['date'] = pd.Series({0:'december 1', 2:'mid may'})
adf

     index  cost item purchased   name        date  delivered  feedback
0  store 1  22.5         sponge  chris  december 1       True  positive
1  store 2   2.5   kitty litter  kevyn         NaN       True      None
2  store 3   5.0          spoon  Filip     mid may       True  negative

## Let's create a student and staff data frame

In [8]:
staff_df = pd.DataFrame([{'name':'kelly', 'role':'director of hr'},
                        {'name':'sally', 'role':'course liaison'},
                        {'name':'james', 'role':'grader'}])

staff_df

    name            role
0  kelly  director of hr
1  sally  course liaison
2  james          grader

In [9]:
student_df = pd.DataFrame([{'name':'james', 'school':'business'},
                           {'name':'mike', 'school':'law'},
                           {'name':'sally', 'school':'engineering'}])

student_df

    name       school
0  james     business
1   mike          law
2  sally  engineering

## Let us set the index of the two data frames

In [10]:
staff_df.set_index('name')

                 role
name
kelly  director of hr
sally  course liaison
james          grader

In [11]:
# As you can see, the set_index doesn't work in place. So we need to overwrite the data frame

staff_df

    name            role
0  kelly  director of hr
1  sally  course liaison
2  james          grader

In [12]:
staff_df = staff_df.set_index('name')
student_df = student_df.set_index('name')

print(staff_df)
print(student_df)

                 role
name
kelly  director of hr
sally  course liaison
james          grader
            school
name
james     business
mike           law
sally  engineering

## Merging 2 data frames on the common index(Similar to join)

## Notice the syntax

We use the left and right index of both the tables, hence true

In [13]:
pd.merge(staff_df, student_df, how = 'outer', left_index=True, right_index=True)

                 role       school
name
james          grader     business
kelly  director of hr          NaN
mike              NaN          law
sally  course liaison  engineering

### Performing intersection (Inner join)

In [14]:
pd.merge(staff_df, student_df, how='inner', left_index = True, right_index=True)

                 role       school
name
sally  course liaison  engineering
james          grader     business

## Left join to preserve all the elements in the left half

In [15]:
pd.merge(staff_df, student_df, how='left', left_index = True, right_index = True)

                 role       school
name
kelly  director of hr          NaN
sally  course liaison  engineering
james          grader     business

## Right join to presever all the elements in the right half

In [16]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 role       school
name
james          grader     business
mike              NaN          law
sally  course liaison  engineering

## Reset the index to demonstarate that you don't need index to join, you can also use column

In [17]:
student_df = student_df.reset_index()
staff_df = staff_df.reset_index()

student_df

    name       school
0  james     business
1   mike          law
2  sally  engineering

## Perform merge using left on and right on

In [18]:
pd.merge(staff_df, student_df, how='left', left_on='name', right_on='name')

    name            role       school
0  kelly  director of hr          NaN
1  sally  course liaison  engineering
2  james          grader     business

# Handling conflicts in columns while merging

Suppose we have a student table consisting of home addresses of students.
We also have a staff table consisting of office addresses of staffs.

Now, the students who are also staffs will have a conflict of address

In [19]:
staff_df = pd.DataFrame([{'name':'kelly', 'role':'director of hr', 'location':'state street'},
                        {'name':'sally', 'role':'course liaison', 'location':'washington avenue'},
                        {'name':'james', 'role':'grader', 'location':'washington avenue'}])

staff_df

            location   name            role
0       state street  kelly  director of hr
1  washington avenue  sally  course liaison
2  washington avenue  james          grader

In [20]:
student_df = pd.DataFrame([{'name':'james', 'school':'business', 'location':'billiard avenue'},
                           {'name':'mike', 'school':'law', 'location':'fraternity house'},
                           {'name':'sally', 'school':'engineering', 'location':'wilson crescent'}])

student_df

           location   name       school
0   billiard avenue  james     business
1  fraternity house   mike          law
2   wilson crescent  sally  engineering

## Merging with conflicting columns

In [21]:
pd.merge(staff_df, student_df, how='left', left_on='name', right_on='name')

          location_x   name            role       location_y       school
0       state street  kelly  director of hr              NaN          NaN
1  washington avenue  sally  course liaison  wilson crescent  engineering
2  washington avenue  james          grader  billiard avenue     business

### As we can see, the conflicting fields are adjusted by appending x to the left column and appending y to the right column

# Performing joins via 2 columns 

Let's say that first names match, while the second name does not match. 

It means that the join should not happen

In [22]:
staff_df = pd.DataFrame([{'first name':'kelly', 'last name':'desjardins', 'role':'director of hr', 'location':'state street'},
                        {'first name':'sally', 'last name' : 'brooks', 'role':'course liaison', 'location':'washington avenue'},
                        {'first name':'james', 'last name': 'wild', 'role':'grader', 'location':'washington avenue'}])

staff_df

  first name   last name           location            role
0      kelly  desjardins       state street  director of hr
1      sally      brooks  washington avenue  course liaison
2      james        wild  washington avenue          grader

In [23]:
student_df = pd.DataFrame([{'first name':'james', 'last name':'hammond', 'school':'business', 'location':'billiard avenue'},
                           {'first name':'mike', 'last name':'smith', 'school':'law', 'location':'fraternity house'},
                           {'first name':'sally', 'last name':'brooks', 'school':'engineering', 'location':'wilson crescent'}])

student_df

  first name last name          location       school
0      james   hammond   billiard avenue     business
1       mike     smith  fraternity house          law
2      sally    brooks   wilson crescent  engineering

As we can see, sally brooks is the only staff and student

In [24]:
pd.merge(staff_df, student_df, how='inner', left_on=['first name', 'last name'], right_on=['first name', 'last name'])

,first name,last name,location_x,role,location_y,school
0,sally,brooks,washington avenue,course liaison,wilson crescent,engineering